import pandas as pd

accident = pd.read_csv('./accident.csv')
print(accident.head())
print(accident.columns)

accident.columns = ['사고년도', '발생월일시', '주야구분', '발생요일', '사망자수', '부상자수', '중상자수', '경상자수', '부상신고자수',
                '발생위치시군구', '발생위치시도', '사고유형대분류', '사고유형중분류', '사고유형', '가해자법규위반', '도로형태대분류', 
                '도로형태', '가해당사자종별', '피해당사자종별', '발생위치X좌표', '발생위치Y좌표', '경도좌표', '위도좌표']

print(accident.columns)

accident['주야구분'] = accident['주야구분'].map({1: '주간', 2: '야간'})
accident['발생요일'] = accident['발생요일'].map({1: '일', 2: '월', 3: '화', 4: '수', 5: '목', 6: '금', 7: '토'})
accident['사고유형대분류'] = accident['사고유형대분류'].map({1: '차대사람', 2: '차대차', 3: '차량단독', 4: '철길건널목'})
accident['사고유형중분류'] = accident['사고유형중분류'].map({11: '횡단중', 12: '차도통행중', 13: '길가장자리구역통행중', 14: '보도통행중', 
        15: '기타', 21: '정면충돌', 22: '측면충돌', 23: '추돌', 24: '기타', 26: '후진중충돌', 31: '공작물충돌', 32: '도로이탈', 33: '주/정차차량충돌', 
        34: '전도전복', 35: '기타', 36: '운전자부재', 38: '전도', 39: '전복', 41: '철길건널목', 'Z2': '차단기돌파', 'Z3': '경보기무시', 'Z4': '직전진행', 
        'Z5': '기타', 'Z6': '기타', '##': '없음', '11': '횡단중', '12': '차도통행중', '13': '길가장자리구역통행중', '14': '보도통행중', 
        '15': '기타', '21': '정면충돌', '22': '측면충돌', '23': '추돌', '24': '기타', '26': '후진중충돌', '31': '공작물충돌', '32': '도로이탈', '33': '주/정차차량충돌', 
        '34': '전도전복', '35': '기타', '36': '운전자부재', '38': '전도', '39': '전복', '41': '철길건널목'})
accident['사고유형'] = accident['사고유형'].map({1: '횡단중', 2: '차도통행중', 3: '길가장자리구역통행중', 4: '보도통행중', 
        5: '기타', 21: '정면충돌', 22: '측면충돌', 23: '추돌', 'Z1': '진행중추돌', 'Z2': '주정차중충돌', 25: '기타', 26: '후진중충돌', 32: '공작물충돌', 34: '도로이탈추락', 35: '도로이탈기타', 33: '주/정차차량충돌', 
        31: '전도전복', 37: '기타', 36: '운전자부재', 38: '전도', 39: '전복', 41: '철길건널목', 'Z4': '차단기돌파', 'Z5': '경보기무시', 'Z6': '직전진행', 
        'Z7': '기타', 'Z8': '기타', '##': '없음', '01': '횡단중', '02': '차도통행중', '03': '길가장자리구역통행중', '04': '보도통행중', '05': '기타', 
        '21': '정면충돌', '22': '측면충돌', '23': '추돌', '25': '기타', '26': '후진중충돌', '32': '공작물충돌', '34': '도로이탈추락', '35': '도로이탈기타', '33': '주/정차차량충돌', 
        '31': '전도전복', '37': '기타', '36': '운전자부재', '38': '전도', '39': '전복', '41': '철길건널목'})
accident['가해자법규위반'] = accident['가해자법규위반'].map({1: '과속', 2: '중앙선침범', 3: '신호위반', 4: '안전거리미확보', 
        5: '안전운전의무불이행', 6: '교차로통행방법위반', 7: '보행자보호의무위반', 99: '기타'})
accident['도로형태대분류'] = accident['도로형태대분류'].map({1: '단일로', 2: '교차로', 4: '철길건널목', 5: '기타', 99: '불명', 'Z3': '기타/불명', 
        '##': '없음', '01': '단일로', '02': '교차로', '04': '철길건널목', '05': '기타', '99': '불명'})
accident['도로형태'] = accident['도로형태'].map({1: '터널안', 2: '교량위', 3: '고가도로위', 4: '지하차도(도로)내', 5: '기타단일로', 
        'Z1': '횡단보도상', 'Z2': '횡단보도부근', 6: '교차로내', 7: '교차로횡단보도내', 8: '교차로부근', 10: '철길건널목', 98: '기타', 99: '불명', 'Z3': '기타/불명', 
        '##': '없음', '01': '터널안', '02': '교량위', '03': '고가도로위', '04': '지하차도(도로)내', '05': '기타단일로', 
        '06': '교차로내', '07': '교차로횡단보도내', '08': '교차로부근', '10': '철길건널목', '98': '기타', '99': '불명'})
accident['가해당사자종별'] = accident['가해당사자종별'].map({1: '승용차', 2: '승합차', 3: '화물차', 4: '특수차', 5: '이륜차', 6: '사륜오토바이(ATV)', 
        7: '원동기장치자전거', 8: '자전거', 9: '개인형이동수단(PM)', 10: '건설기계', 11: '농기계', 12: '보행자', 98: '기타', 99: '불명', 
        'Z1': '열차', 'ZL': '기타', '##': '없음'})
accident['피해당사자종별'] = accident['피해당사자종별'].map({1: '승용차', 2: '승합차', 3: '화물차', 4: '특수차', 5: '이륜차', 6: '사륜오토바이(ATV)', 
        7: '원동기장치자전거', 8: '자전거', 9: '개인형이동수단(PM)', 10: '건설기계', 11: '농기계', 12: '보행자', 98: '기타', 99: '불명', 
        'Z1': '열차', 'ZL': '기타', '##': '없음', '10': '건설기계', '11': '농기계', '12': '보행자', '98': '기타', '99': '불명', 
        '01': '승용차', '02': '승합차', '03': '화물차', '04': '특수차', '05': '이륜차', '06': '사륜오토바이(ATV)', '07': '원동기장치자전거', '08': '자전거', '09': '개인형이동수단(PM)'})

print(accident.head())

print(accident['주야구분'].value_counts())

print(accident.isna().sum())

accident.to_csv('car_accident.csv', index=False, encoding='utf-8')